package com.company;

import javax.swing.*;

public class HelloWord {
    public static void main(String[] args) {
        System.out.println("Hello Word");

        JOptionPane.showMessageDialog(null,"Hello word");
 /*
         Компилятор полностью игнорирует комментарии
         И что бы я тут не писал вывода на экран не будет
        */

        // Комментарии могут быть разных видов, например:

        // - текст вашего комментария начнётся сразу за чертами и кончится в конце строки.

        /* 2 вид комментария */

        /**
         Документирование комментариями:
         текст
         комментарий
         и.т.д
         Ну если конечно писать в комментариях что-то важное то они действительно помогут (например начинающим):
         */




    }
}
